---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeLibrary.Reset
source: html/05734cf8-b84d-63de-47f2-9abc8f226fc7.htm
---
# Autodesk.Revit.DB.DirectShapeLibrary.Reset Method

Removes all definitions from library. This is useful when importing several self-contained data sets within one session.
 Once a data set is imported, keeping the definitions specific to that data set will slow down the searches.

## Syntax (C#)
```csharp
public void Reset()
```